<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="actual_input" type="Parameter" version="opset1">
			<data shape="1,1,96,2000" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="actual_input">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_2051_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 95" offset="0" size="190" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>95</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_2051" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>95</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>95</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_2050_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="190" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_2050" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_2049_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="192" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_2049" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Subtract_455" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_2015_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 3, 3" offset="194" size="288" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_2015" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_43_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="482" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_43" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="641">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_47_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="514" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_47" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="LeakyRelu_1" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="74">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="MaxPool_2" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="75">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="645_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="516" size="9216" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="645" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="645">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_61_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="9732" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_61" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="644">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_65_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="514" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_65" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="LeakyRelu_4" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="78">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MaxPool_5" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="79">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="648_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="48, 32, 3, 3" offset="9796" size="27648" />
			<output>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="648" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="648">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_79_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 48, 1, 1" offset="37444" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_79" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="647">
					<dim>1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_83_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="514" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_83" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="LeakyRelu_7" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="82">
					<dim>1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="MaxPool_8" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="83">
					<dim>1</dim>
					<dim>48</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>48</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="651_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 48, 3, 3" offset="37540" size="55296" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="651" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="651">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_97_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="92836" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_97" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="650">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_101_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="514" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_101" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="LeakyRelu_10" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="86">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="654_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="80, 64, 3, 3" offset="92964" size="92160" />
			<output>
				<port id="0" precision="FP16">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="654" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="654">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_114_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 80, 1, 1" offset="185124" size="160" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_114" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="653">
					<dim>1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_118_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="514" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_118" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="LeakyRelu_12" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="89">
					<dim>1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_2004_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12" offset="185284" size="24" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_2004" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="MatMul_14" type="MatMul" version="opset1">
			<data transpose_a="true" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="92">
					<dim>1</dim>
					<dim>80</dim>
					<dim>250</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Add_15" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>250</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="93">
					<dim>1</dim>
					<dim>80</dim>
					<dim>250</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_1964" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185308" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Squeeze_1965" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>250</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="95">
					<dim>1</dim>
					<dim>80</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_1968" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="185316" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transpose_174" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>250</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_138_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="185340" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="65" name="Constant_138" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="66" name="657" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185342" size="8" />
			<output>
				<port id="0" precision="I64" names="657">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_128" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="185316" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Transpose_18" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="96">
					<dim>1</dim>
					<dim>250</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Shape_19" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>250</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="97">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_1888" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185350" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_132" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="185350" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="72" name="Gather_21" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="103">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="658" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185358" size="8" />
			<output>
				<port id="0" precision="I64" names="658">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Concat_23" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="105">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="ConstantOfShape_24" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="106">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_30" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185350" size="8" />
			<output>
				<port id="0" precision="I64" names="232">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_31" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185366" size="8" />
			<output>
				<port id="0" precision="I64" names="233">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Broadcast_157" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185374" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Slice_32" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="234">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_201" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="185382" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Transpose_202" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_146_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="185340" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="83" name="Constant_146" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="84" name="659" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185342" size="8" />
			<output>
				<port id="0" precision="I64" names="659">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_1894" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185350" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Gather_210" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="110">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="660" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185358" size="8" />
			<output>
				<port id="0" precision="I64" names="660">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Concat_26" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="112">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="ConstantOfShape_27" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="113">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_34" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185350" size="8" />
			<output>
				<port id="0" precision="I64" names="236">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_35" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185366" size="8" />
			<output>
				<port id="0" precision="I64" names="237">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Broadcast_167" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185374" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Slice_36" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="238">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_203" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="185382" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Transpose_204" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="ShapeOf_181" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>250</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_185" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="185406" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_182" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="185410" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Gather_186" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_183" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="185410" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Gather_184" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Broadcast_198" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Concat_177_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1024, 80" offset="185414" size="327680" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Concat_177" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Concat_180_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1024, 256" offset="513094" size="1048576" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Concat_180" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Concat_197_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1024" offset="1561670" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Concat_197" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="LSTMSequence_212" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="256" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>250</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>250</dim>
					<dim>256</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_1970" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1565766" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Transpose_38" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>250</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="242">
					<dim>250</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_39" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1565798" size="24" />
			<output>
				<port id="0" precision="I64" names="243">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Reshape_40" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>250</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="244">
					<dim>250</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_246" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="185382" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Transpose_247" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>250</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>250</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_42" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185366" size="8" />
			<output>
				<port id="0" precision="I64" names="361">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_43" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185342" size="8" />
			<output>
				<port id="0" precision="I64" names="362">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Broadcast_230" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185374" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Slice_44" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="363">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_274" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="185382" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Transpose_275" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_46" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185366" size="8" />
			<output>
				<port id="0" precision="I64" names="365">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_470" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185342" size="8" />
			<output>
				<port id="0" precision="I64" names="366">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Broadcast_240" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="185374" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Slice_48" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="367">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_276" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="185382" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Transpose_277" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="ShapeOf_254" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>250</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_258" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="185406" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
