<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="backbone.cls_token" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="0" size="768" />
			<output>
				<port id="0" precision="FP32" names="backbone.cls_token">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Gather_4878" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="768" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Multiply_4674" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gather_4881" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="780" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Divide_1340" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_205020" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="792" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="7" name="Constant_205021" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="796" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="8" name="Constant_205022" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="792" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="Constant_205023" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="796" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="10" name="Divide_1340/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_3523" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="800" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_157" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="808" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="808" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_1487" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/Mul" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="816" size="24" />
			<output>
				<port id="0" precision="I64" names="/Mul_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/Equal_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="840" size="24" />
			<output>
				<port id="0" precision="I64" names="/ConstantOfShape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Where_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Expand_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Gather_4884" type="Const" version="opset1">
			<data element_type="i8" shape="192, 3, 16, 16" offset="864" size="147456" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Convert_405731" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_405629" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 1" offset="148320" size="768" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/patch_embed/projection/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/patch_embed/projection/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="16, 16" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_171" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="149088" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/patch_embed/projection/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/projection/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/patch_embed/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/patch_embed/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/patch_embed/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" names="/patch_embed/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/patch_embed/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="149856" size="8" />
			<output>
				<port id="0" precision="I64" names="/patch_embed/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Broadcast_182" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="149864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/patch_embed/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/patch_embed/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/patch_embed/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="808" size="8" />
			<output>
				<port id="0" precision="I64" names="/patch_embed/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/patch_embed/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/patch_embed/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/patch_embed/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/Reshape_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_192" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="149872" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/patch_embed/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/Transpose_output_0">
					<dim>1</dim>
					<dim>196</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>196</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="backbone.pos_embed" type="Const" version="opset1">
			<data element_type="f32" shape="1, 197, 192" offset="149896" size="151296" />
			<output>
				<port id="0" precision="FP32" names="backbone.pos_embed">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_4889" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="301192" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_4887" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 576" offset="301960" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_239" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/layers.0/ln1/Div" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/ln1/Div_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_4885" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="304264" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/layers.0/ln1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/ln1/Mul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_4886" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="305032" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/layers.0/ln1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/ln1/Add_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_183318" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="305800" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/layers.0/ln1/Add_1_0_0/sq_multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_205030" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="306568" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="56" name="Constant_205031" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="306572" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="57" name="Constant_205032" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="306568" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="58" name="Constant_205033" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="306572" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="59" name="/layers.0/ln1/Add_1_0_0/sq_multiply/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_4440" type="Const" version="opset1">
			<data element_type="i8" shape="576, 192" offset="306576" size="110592" />
			<output>
				<port id="0" precision="I8">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Convert_405885" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_405783" type="Const" version="opset1">
			<data element_type="f32" shape="576, 1" offset="417168" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/layers.0/attn/qkv/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/layers.0/attn/qkv/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/qkv/MatMul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/layers.0/attn/qkv/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/qkv/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/layers.0/attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/layers.0/attn/Shape_1_output_0,/layers.0/attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_3814" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="419472" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_3815" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="69" name="Gather_3816" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/layers.0/attn/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="419488" size="8" />
			<output>
				<port id="0" precision="I64" names="/layers.0/attn/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/layers.0/attn/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="419488" size="8" />
			<output>
				<port id="0" precision="I64" names="/layers.0/attn/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/layers.0/attn/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="419496" size="8" />
			<output>
				<port id="0" precision="I64" names="/layers.0/attn/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/layers.0/attn/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/layers.0/attn/Concat_output_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/layers.0/attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/Reshape_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_273" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="419504" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/layers.0/attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/Transpose_output_0">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_205045" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419544" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="78" name="Constant_205046" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419548" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="Constant_205047" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419544" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="Constant_205048" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419548" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="81" name="/layers.0/attn/Gather_2/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="83" name="Constant_275" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="84" name="/layers.0/attn/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/layers.0/attn/Gather_2_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/patch_embed/projection/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149864" size="8" />
			<output>
				<port id="0" precision="I64" names="/patch_embed/projection/Constant_output_0" />
			</output>
		</layer>
		<layer id="86" name="Constant_277" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="87" name="/layers.0/attn/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/layers.0/attn/Gather_3_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_4888" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="419552" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Multiply_4678" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_205040" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419556" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="91" name="Constant_205041" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419560" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="92" name="Constant_205042" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419556" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="93" name="Constant_205043" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="419560" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="94" name="Multiply_4678/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/layers.0/attn/Mul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/Mul_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/layers.0/attn/Softmax" type="SoftMax" version="opset8">
			<data axis="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/attn/Softmax_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/patch_embed/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149856" size="8" />
			<output>
				<port id="0" precision="I64" names="/patch_embed/Constant_output_0" />
			</output>
		</layer>
		<layer id="98" name="Constant_279" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="99" name="/layers.0/attn/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/layers.0/attn/Gather_4_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/layers.0/attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/MatMul_1_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_288" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="419564" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/layers.0/attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/Transpose_2_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_3819" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="419472" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_3820" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="800" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="105" name="Gather_3821" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/layers.0/attn/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="419596" size="8" />
			<output>
				<port id="0" precision="I64" names="/layers.0/attn/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/layers.0/attn/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layers.0/attn/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/layers.0/attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/Reshape_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_183330" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="419604" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/layers.0/attn/Reshape_1_0_0/sq_multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_205050" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="420372" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="112" name="Constant_205051" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="420376" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="113" name="Constant_205052" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="420372" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="114" name="Constant_205053" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="420376" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="/layers.0/attn/Reshape_1_0_0/sq_multiply/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_4444" type="Const" version="opset1">
			<data element_type="i8" shape="192, 192" offset="420380" size="36864" />
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Convert_406039" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_405937" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1" offset="457244" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/layers.0/attn/proj/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/layers.0/attn/proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/proj/MatMul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/layers.0/attn/proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/attn/proj/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/layers.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_4893" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="458012" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_4892" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="458780" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_302" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/layers.0/ln2/Div" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/ln2/Div_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_4890" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="461852" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/layers.0/ln2/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/ln2/Mul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_4891" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="462620" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="/layers.0/ln2/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/ln2/Add_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Constant_183320" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="463388" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="/layers.0/ln2/Add_1_0_0/sq_multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Constant_205060" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="464156" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="134" name="Constant_205061" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="464160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="135" name="Constant_205062" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="464156" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="136" name="Constant_205063" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="464160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="137" name="/layers.0/ln2/Add_1_0_0/sq_multiply/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Constant_4449" type="Const" version="opset1">
			<data element_type="i8" shape="768, 192" offset="464164" size="147456" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Convert_406193" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</input>
