<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Gather_26452" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Multiply_24710" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Gather_26455" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Divide_5719" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/backbone/conv_stem/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="6" name="/backbone/conv_stem/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/backbone/conv_stem/Shape_1_output_0,/backbone/conv_stem/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/backbone/conv_stem/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="8" name="Constant_350" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="9" name="/backbone/conv_stem/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/conv_stem/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="10" name="/backbone/conv_stem/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="11" name="/backbone/conv_stem/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="12" name="/backbone/conv_stem/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Cast_1_output_0,/backbone/conv_stem/Cast_output_0,/backbone/conv_stem/Div_output_0" />
			</output>
		</layer>
		<layer id="13" name="Constant_375" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/backbone/conv_stem/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/conv_stem/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="16" name="Constant_377" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/backbone/conv_stem/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/conv_stem/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="19" name="/backbone/conv_stem/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_output_0" />
			</output>
		</layer>
		<layer id="20" name="Constant_346" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="/backbone/conv_stem/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/conv_stem/Gather_output_0" />
			</output>
		</layer>
		<layer id="22" name="/backbone/conv_stem/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Sub_output_0" />
			</output>
		</layer>
		<layer id="23" name="/backbone/conv_stem/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="24" name="/backbone/conv_stem/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Cast_2_output_0,/backbone/conv_stem/Cast_3_output_0,/backbone/conv_stem/Div_1_output_0" />
			</output>
		</layer>
		<layer id="25" name="Constant_379" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/backbone/conv_stem/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/conv_stem/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="28" name="Constant_381" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/backbone/conv_stem/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/conv_stem/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/backbone/conv_stem/Cast_4_output_0,/backbone/conv_stem/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/backbone/conv_stem/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56" size="32" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/backbone/conv_stem/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Concat_2_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/backbone/conv_stem/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="88" size="16" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_8_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/conv_stem/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/conv_stem/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone/conv_stem/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/conv_stem/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/conv_stem/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/backbone/conv_stem/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/backbone/conv_stem/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_406" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="120" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/backbone/conv_stem/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_8330" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/backbone/conv_stem/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/conv_stem/Cast_5_output_0,/backbone/conv_stem/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_414" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="44" name="Split_415" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/backbone/conv_stem/Constant_14" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="136" size="4" />
			<output>
				<port id="0" precision="FP32" names="/backbone/conv_stem/Constant_14_output_0" />
			</output>
		</layer>
		<layer id="46" name="/backbone/conv_stem/Pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/backbone/conv_stem/Pad_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>225</dim>
					<dim>225</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Gather_26458" type="Const" version="opset1">
			<data element_type="f32" shape="24, 3, 3, 3" offset="140" size="2592" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/conv_stem/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>225</dim>
					<dim>225</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_554" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2732" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/backbone/conv_stem/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/conv_stem/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx::Conv_1664" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 3, 3" offset="2828" size="20736" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1664">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone/blocks/blocks.0/blocks.0.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_571" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="23564" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/blocks/blocks.0/blocks.0.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.0/blocks.0.0/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone/blocks/blocks.0/blocks.0.0/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/blocks/blocks.0/blocks.0.0/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/backbone/blocks/blocks.0/blocks.0.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.0/blocks.0.0/Add_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::Conv_1667" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 3, 3" offset="23660" size="20736" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1667">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/blocks/blocks.0/blocks.0.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_589" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="44396" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/backbone/blocks/blocks.0/blocks.0.1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.0/blocks.0.1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/backbone/blocks/blocks.0/blocks.0.1/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/blocks/blocks.0/blocks.0.1/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/blocks/blocks.0/blocks.0.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.0/blocks.0.1/Add_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="44492" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="65" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Shape_1_output_0,/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="67" name="Constant_602" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="68" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="69" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="70" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="71" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Cast_1_output_0,/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Cast_output_0,/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Div_output_0" />
			</output>
		</layer>
		<layer id="72" name="Constant_627" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="75" name="Constant_629" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="44492" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="78" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_output_0" />
			</output>
		</layer>
		<layer id="79" name="Constant_598" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="80" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Gather_output_0" />
			</output>
		</layer>
		<layer id="81" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub_output_0" />
			</output>
		</layer>
		<layer id="82" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="83" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Cast_2_output_0,/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Cast_3_output_0,/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Div_1_output_0" />
			</output>
		</layer>
		<layer id="84" name="Constant_631" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="87" name="Constant_633" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Cast_4_output_0,/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56" size="32" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Concat_2_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="88" size="16" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_8_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_658" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="120" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_8331" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Cast_5_output_0,/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_666" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="103" name="Split_667" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_14" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="136" size="4" />
			<output>
				<port id="0" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Constant_14_output_0" />
			</output>
		</layer>
		<layer id="105" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Pad_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="onnx::Conv_1670" type="Const" version="opset1">
			<data element_type="f32" shape="96, 24, 3, 3" offset="44500" size="82944" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1670">
					<dim>96</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_806" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="127444" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.0/conv_exp/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/backbone/blocks/blocks.1/blocks.1.0/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.0/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="onnx::Conv_1673" type="Const" version="opset1">
			<data element_type="f32" shape="48, 96, 1, 1" offset="127828" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1673">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/backbone/blocks/blocks.1/blocks.1.0/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Reshape_823" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="146260" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/backbone/blocks/blocks.1/blocks.1.0/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.0/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="onnx::Conv_1676" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 3, 3" offset="146452" size="331776" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1676">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/backbone/blocks/blocks.1/blocks.1.1/conv_exp/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Reshape_838" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="478228" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/backbone/blocks/blocks.1/blocks.1.1/conv_exp/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.1/conv_exp/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/backbone/blocks/blocks.1/blocks.1.1/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.1/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="onnx::Conv_1679" type="Const" version="opset1">
			<data element_type="f32" shape="48, 192, 1, 1" offset="478996" size="36864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1679">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/backbone/blocks/blocks.1/blocks.1.1/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Reshape_855" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="515860" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/backbone/blocks/blocks.1/blocks.1.1/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.1/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/backbone/blocks/blocks.1/blocks.1.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/blocks/blocks.1/blocks.1.1/Add_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="onnx::Conv_1682" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 3, 3" offset="516052" size="331776" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1682">
					<dim>192</dim>
